README.md
```mermaid
classDiagram
    direction BT

    class Application {
        <<dataclass>>
        -CompiledStateGraph app
        -StateGraph workflow
        -_add_conditional() None
        -_add_nodes() None
        -_add_nodes_sequence() None
        +generate_image() None
        +invoke(question: str) str
    }

    class DocumentsGraderAnswer {
        <<pydantic>>
        +bool answer
        +str explanation
        +dict analyzed_document
    }

    class GraphState {
        <<pydantic>>
        +str question
        +str rewrited_question
        +str response
        +list~Document~ documents
        +list~Document~ codes
        +list~BaseMessage~ history
    }

    class LargeLanguageModel {
        <<dataclass>>
        +RunnableSequence chain
        +HumanMessagePromptTemplate human_prompt_template
        +ChatGoogleGenerativeAI llm
        +Optional~DocumentsGraderAnswer~ structured_output
        +Optional~str~ system_instruction
        +SystemMessagePromptTemplate system_prompt_template
        +batch(inputs: list~dict~str, Document~~, config: RunnableConfig) list~Document~
        +invoke(**kwargs: str) Document
    }

    class LargeLanguageModelHistory {
        <<dataclass>>
    }

    class QueryRetriever {
        <<dataclass>>
        +Chroma client_vector_db
        +MultiQueryRetriever multi_query_retrivier
        +RetrieverOptions type_data_query
        +invoke(prompt: str) list~Document~
    }

    class RetrieverOptions {
        <<enumeration>>
        HTML
        PYTHON
    }

    Application --> GraphState : workflow / app
    LargeLanguageModel --> DocumentsGraderAnswer : structured_output
    LargeLanguageModel <|-- LargeLanguageModelHistory
    QueryRetriever --> RetrieverOptions : type_data_query
```
