classes.dot
digraph "classes" {
rankdir=BT
charset="utf-8"
"chatbot_agent.graph.Application" [color="black", fontcolor="black", label=<{Application|app : CompiledStateGraph<br ALIGN="LEFT"/>workflow : StateGraph<br ALIGN="LEFT"/>|__init__(self, workflow: StateGraph): None<br ALIGN="LEFT"/>__post_init__(): None<br ALIGN="LEFT"/>_add_conditional(): None<br ALIGN="LEFT"/>_add_nodes(): None<br ALIGN="LEFT"/>_add_nodes_sequence(): None<br ALIGN="LEFT"/>generate_image(): None<br ALIGN="LEFT"/>invoke(question: str): str<br ALIGN="LEFT"/>}>, shape="record", style="solid"];
"chatbot_agent.chain.create_chains.LargeLanguageModel" [color="black", fontcolor="black", label=<{LargeLanguageModel|chain : RunnableSequence<br ALIGN="LEFT"/>human_prompt_template : HumanMessagePromptTemplate<br ALIGN="LEFT"/>llm : ChatGoogleGenerativeAI<br ALIGN="LEFT"/>structured_output : Optional[DocumentsGraderAnswer]<br ALIGN="LEFT"/>system_instruction : Optional[str]<br ALIGN="LEFT"/>system_prompt_template : SystemMessagePromptTemplate<br ALIGN="LEFT"/>|__init__(self, llm: ChatGoogleGenerativeAI, system_instruction: str, structured_output: DocumentsGraderAnswer): None<br ALIGN="LEFT"/>__post_init__(): None<br ALIGN="LEFT"/>batch(inputs: list[dict[str, Document]], config: RunnableConfig): list[Document]<br ALIGN="LEFT"/>invoke(): Document<br ALIGN="LEFT"/>}>, shape="record", style="solid"];
"chatbot_agent.chain.create_chains.LargeLanguageModelHistory" [color="black", fontcolor="black", label=<{LargeLanguageModelHistory|chain<br ALIGN="LEFT"/>|<I>__init__</I>(llm: ChatGoogleGenerativeAI, system_instruction: str, structured_output: DocumentsGraderAnswer): None<br ALIGN="LEFT"/>__post_init__(): None<br ALIGN="LEFT"/>}>, shape="record", style="solid"];
"chatbot_agent.chain.create_chains.QueryRetriever" [color="black", fontcolor="black", label=<{QueryRetriever|client_vector_db : Chroma<br ALIGN="LEFT"/>multi_query_retrivier : MultiQueryRetriever<br ALIGN="LEFT"/>type_data_query<br ALIGN="LEFT"/>|__init__(self, client_vector_db: Chroma, type_data_query: RetrieverOptions): None<br ALIGN="LEFT"/>__post_init__(): None<br ALIGN="LEFT"/>invoke(prompt: str): list[Document]<br ALIGN="LEFT"/>}>, shape="record", style="solid"];
"chatbot_agent.chain.create_chains.RetrieverOptions" [color="black", fontcolor="black", label=<{RetrieverOptions|name<br ALIGN="LEFT"/>|}>, shape="record", style="solid"];
"chatbot_agent.chain.create_chains.LargeLanguageModelHistory" -> "chatbot_agent.chain.create_chains.LargeLanguageModel" [arrowhead="empty", arrowtail="none"];
"chatbot_agent.chain.create_chains.QueryRetriever" -> "chatbot_agent.chain.create_chains.RetrieverOptions" [arrowhead="vee", arrowtail="none", fontcolor="green", label="type_data_query", style="solid"];
}
